georgian_to_russian = {'ა': 'а', 'ბ': 'б', 'გ': 'г', 'დ': 'д', 'ე': 'е', 'ვ': 'в', 'ზ': 'з', 'ჱ': '', 'თ': 'т', 'ი': 'и', 'კ': 'к', 'ლ': 'л', 'მ': 'м', 'ნ': 'н', 'ჲ': 'й', 'ო': 'о', 'პ': 'п', 'ჟ': 'ж', 'რ': 'р', 'ს': 'с', 'ტ': 'т', 'უ': 'у', 'ფ': 'п', 'ქ': 'к', 'ღ': 'г', 'ყ': 'к', 'შ': 'ш', 'ც': 'ц', 'ძ': 'дз', 'წ': 'ць', 'ჭ': 'ч', 'ხ': 'х', 'ჯ': 'дж', 'ჰ': 'х', 'ჴ': '', 'ჵ': '', 'ჩ': 'ч'}
words = input().strip('.,!?:;-')
for letter in words:
    if letter in georgian_to_russian:
        print(georgian_to_russian[letter], end='')
    elif letter == ' ':
        print(' ', end='')